Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་གདུང་ནི་མི་གཅོད་ཕྱིར། །བདག་གིས་ཀྱང་ནི་བཤད་པ་ཡིན། །སྔགས་པའི་ལས་རྣམས་ཀུན་ལ་ནི། །ཀུན་མཁྱེན་ཡེ་ཤེས་འབྱུང་དོན་དུའོ། །
en: “With the earnest desire that the lineage Of the buddhas remains unbroken, And that omniscient wisdom arises In all activities of the mantra practitioners. {15.236}

source: ཀུན་མཁྱེན་ཡེ་ཤེས་རབ་འཇུག་ལ། །ལས་རྣམས་གཅིག་ཏུ་བསྔགས་པ་ཡིན། །
en: “The only activity that deserves to be praised Is the one based on omniscient knowledge.

source: འཇིག་རྟེན་སྔོན་ལས་བདག་ཡིན་ཏེ། །དེ་ནི་ད་ལྟར་ཡོངས་སུ་སྤྱོད། །
en: Since previous actions performed in one’s respective world Are being experienced now, {15.237}

source: དེ་བས་ལས་རྣམས་རབ་ཏུ་བྱ། །ཚེ་འདིར་དཀའ་བ་ལེགས་སྤྱད་ཅིང་། །
en: “One should perform the [right] activities, Though it may be difficult to perform them in this life.

source: ལས་ལྡན་ཚེ་ནི་འདི་ལ་ཡང་། །འབད་པ་མེད་པར་སྔགས་རྣམས་འགྲུབ། །
en: Based on these activities, the mantras will succeed Without effort even in this life. {15.238}

source: ལས་ནི་འདི་ལའང་སྣང་འགྱུར་ན། །སྐྱེ་བ་འདི་ལ་འགྲུབ་པར་འགྱུར། །
en: “The accomplishment will come in this life, Manifesting also in one’s activity.

source: དེ་བས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས། །ལས་ནི་གཅིག་པུ་རབ་ཏུ་བསྔགས། །
en: The ritual activity is therefore Extolled by all the buddhas as something unique. {15.239}

source: ལས་དེ་ཆོ་གར་ལྡན་པ་ན། །དེ་ནི་འདི་ལ་མྱུར་དུ་འགྲུབ། །
en: “When such activity is performed according to procedure, The accomplishment will swiftly follow, even in this life.

source: སེམས་ཅན་བྱིས་པ་ཆོ་ག་ཉམས། །རབ་ཏུ་རྨོངས་པ་འཁོར་བར་འགྱུར། །
en: Naive and careless beings, Who are ignorant of the right procedure, follow erroneous paths. {15.240}

source: དེ་བས་རྣམ་པ་ཀུན་གྱིས་ནི། །ལས་ནི་གཅིག་པུ་རབ་བསྔགས་ཡིན། །
en: “Thus these activities alone, with all their aspects, Have been deemed praiseworthy.

source: ཆོ་ག་ལས་ནི་ཡང་དག་ལྡན། །
en: The activity should follow the procedure;

source: སྒྲུབ་པ་པོས་ནི་བསྒྲུབ་པར་བྱ། །དེ་བཞིན་ཆོ་ག་ཉམས་པའི་ལས། །ཤིན་ཏུ་ཡུན་རིང་དག་གིས་འགྲུབ། །
en: If it does, it will be successful. Activity that lacks the right procedure Will not succeed even after a very long time. {15.241}

source: བསམ་གཏན་མེད་པར་ཐར་པ་མེད། །
en: “There is no liberation without samādhi;

source: ཐར་པ་མེད་པར་བསམ་གཏན་མེད། །
en: Liberation is never devoid of samādhi.

source: དེ་བས་བསམ་གཏན་ཐར་པ་ནི། །ཡང་དག་ལྡན་པ་བྱང་ཆུབ་བརྗོད། །
en: Accordingly, awakening is said To combine samādhi and liberation.” {15.242}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག །བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། ལས་ཐམས་ཅད་ཀྱི་བྱ་བའི་དོན་གྱི་ལེའུ་རབ་འབྱམ་བཅྭ་ལྔ་པ་རྫོགས་སོ།། །།
en: This concludes the chapter with detailed instructions on the meaning of all ritual activities, fifteenth in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་གཞན་ཡང་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ལ་གཟིགས་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: The blessed Śākyamuni looked again at the realm of the Pure Abode and spoke to Mañjuśrī, the divine youth:

source: བློ་དང་ལྡན་པ་གནོད་སྦྱིན་གྱི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ང་ལ་དྲིས་ནསའཇམ་དཔལ་ཁྱོད་ཀྱི་དོན་ཐམས་ཅད་བྱ་བའི་ལས་ཀྱི་ལེའུ་རབ་འབྱམ་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་ནང་དུ་རྒྱ་ཆེར་སྔར་བསྟན་པ་ཡིན་ནོ། །
en: “Mañjuśrī! Requested by the wise king of yakṣa s who holds a vajra in his hand, I already taught in detail, in the middle of this assembly, your complete chapter on the ritual activities intended for all purposes. {16.1}

source: སྔགས་ཀུན་དོན་དང་ལྡན་པ་ཡི། །རྨི་ལམ་དགེ་དང་མི་དགེ་ཡིན། །
en: “I taught about the good and bad aspects of dreams And how they relate to all the mantra purposes.

source: དེས་ན་ཞར་ལ་འདི་ཀུན་ནི། །སྔགས་ཀྱི་ཟློས་པ་བསྟན་པ་ཡིན། །
en: I taught all of it at length For the mantra reciters.” {16.2}

source: གནོད་སྦྱིན་བདག་པོ་ཡིད་དགའ་ནས། །ཐལ་སྦྱར་སྤྱི་བོར་བྱས་ནས་ནི། །སྟོན་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། །དེ་ཚེ་ཚིག་ནི་འདི་སྐད་ཞུས། །
en: The king of yakṣa s, pleased at heart, Folded his hands at his forehead and, Bowing his head before the Teacher, Said at that time, {16.3}

source: འཇིག་རྟེན་རྗེས་སུ་གཟུང་དོན་དུ། །བློ་མཆོག་རྣམས་ཀྱིས་གསུངས་པ་དང་། །བདག་ལའང་རྗེས་སུ་ཐུགས་བརྩེ་དང་། །སེམས་ཅན་རྣམས་ནི་བདེ་དོན་དུ། །ཟློས་པའི་སྔགས་ནི་ཐམས་ཅད་ལ། །རྨི་ལམ་དགེ་དང་མི་དགེ་དང་། །སེམས་ཅན་མཆོག་དང་ཐ་མ་ཡི། །སྤྱོད་པའི་ཡོན་ཏན་རྒྱ་ཆེར་བསྟན། །བཟང་པོའི་འགྲོ་བའི་སྐྱེ་གནས་དང་། །རྒྱུ་དང་ཤེས་པའི་རྣམ་པ་སྤྱོད། །
en: “The one of supreme intellect taught Out of his kindness for the people, Out of his compassion for me, And for the happiness of beings, {16.4} “About the good and bad aspects Of all the mantras and dreams of the reciters, About the extensive qualities of the conduct Of noble and debased beings, And about determining the causes For the highest birth and destiny. {16.5}

source: འདས་དང་མ་འོངས་ཤེས་པ་དང་། །དགེ་དང་མི་དགེ་ད་ལྟར་གྱི། །
en: “He taught the knowledge of what is beneficial And detrimental—past, present, and future.

source: ཐམས་ཅད་ཀུན་འགྲོའི་ཤེས་པ་དང་། །ཀུན་མཁྱེན་ཡེ་ཤེས་སྤྱོད་པ་དང་། །སྣང་མེད་དམིགས་པ་མེད་པ་དང་། །སྤྲོས་མེད་རབ་ཏུ་སྤྲོས་པ་ཡིན། །
en: He taught the complete, all-encompassing knowledge— The dynamic aspect of all-knowing awareness. {16.6} “He taught about the auspicious tranquility described As being without a visible form, without support,

source: རྣམ་པ་ཀུན་མཆོག་ལྡན་པ་དང་། །ཤིས་པ་ཞི་བ་བསྟན་པ་ཡིན། །
en: Which expands without mental elaboration And is endowed with all the supreme aspects. {16.7}

source: སངས་རྒྱས་ཀུན་གྱི་མཐུ་རྣམས་ནི། །བློ་མཆོག་གིས་ནི་བསྟན་པ་ཡིན། །ཁྱད་པར་དུ་ནི་ཟློས་པ་ལ། །སྔགས་རྣམས་དོན་དང་ལྡན་པར་བཤད། །
en: “The one of superior intellect Described the powers of all the buddhas In particular for those reciters Who pursue all the aims of mantra. {16.8}

source: ལས་དང་ལས་འབྲས་སེམས་ཅན་གྱི། །བྱ་བ་དུས་དང་དེ་བཞིན་དུ། །
en: “He taught the ritual activity, its complete result, And the right time for the rituals;

source: དེ་བཞིན་སྣོད་དང་གནས་དང་ནི། །ཆ་བྱད་རྨི་ལམ་ཞར་ལ་གསུངས། །
en: He taught about the vessel, the place, and the possession, Which teachings were requested in the context of dreams.” {16.9}

source: གནོད་སྦྱིན་བདག་པོ་ཐུབ་མཆོག་ནི། །དེ་བཞིན་གཤེགས་པ་བདུན་པ་ལ། །
en: The king of yakṣa s then bowed to the best of sages, To the supreme seventh tathāgata.

source: གང་ཞིག་བསྐལ་བཟང་སངས་རྒྱས་པ། །ཤཱཀྱའི་སྐྱེས་མཆོག་བདུན་པ་འདི། །
en: Whatever buddhas appeared in the auspicious eon, The Bull of the Śākyas was the seventh of them. {16.10}

source: ཤཱཀྱའི་སེང་གེ་དགྲ་ལས་རྒྱལ། །འདི་ནི་བདུན་པར་རབ་ཏུ་བརྟགས། །
en: He, Lion of the Śākyas who conquered the enemies, Is regarded as the seventh—

source: དུས་ཀྱི་ཐ་མར་རྫོགས་སངས་རྒྱས། །འཇིག་རྟེན་མགོན་པོ་འོད་བྱེད་པ། །
en: The lord of the world, the bringer of light, A perfect buddha for the lowest eon, {16.11}

source: བརྩོན་འགྲུས་ཆེ་ཞིང་ཤེས་རབ་ཆེ། །ཐུབ་པ་མཐུ་ནི་ཆེན་པོ་ཐོབ། །
en: A sage of great diligence and wisdom, Renowned for his great energy.

source: ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་བདག །བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་བྱས་ཏེ། །
en: It was to him that the yakṣa Vajrapāṇi Bowed in homage. {16.12}

source: རང་གི་གནས་སུ་འདུག་གྱུར་ནས། །བློ་ལྡན་དེ་ནས་ཅང་མི་སྨྲ། །དེ་ནས་འཇམ་དཔལ་ཤེས་རབ་ཆེ། །དེ་ཚེ་ཐུབ་པས་དྲིས་པ་ནི། །
en: Mañjuśrī, the wise one, stayed silent And remained in his seat. The [seventh] sage then spoke to him, The sagacious one, as follows: {16.13}

source: རྫོགས་སངས་རྒྱས་ལ་བསྐུལ་བ་ནི། །ཐུབ་མཆོག་དམ་པ་ཐ་མ་ལ། །ལེགས་སོ་བཅོམ་ལྡན་རྫོགས་སངས་རྒྱས། །ལས་དང་ཤེས་པ་རྒྱ་ཆེར་བཅས། །
en: “[Vajrapāṇi] requested the Buddha, The most recent and chief among sages, ‘It is good, O fully awakened Blessed One! Please teach at length the knowledge of ritual activities. {16.14}

source: བཅས་པའི་གཟའ་ནི་གཙོ་བོ་སྟེ། །དགེ་དང་མི་དགེ་ལེགས་ཚུལ་བཤད། །
en: “ ‘Teach how one’s birth horoscope constitutes the chief factor In explaining one’s virtuous and nonvirtuous character traits;

source: ལས་དང་ཤེས་པ་རྒྱུར་བཅས་པའི། །སེམས་ཅན་མང་པོའི་སྤྱོད་པ་གསུངས། །
en: Explain the actions of many beings Based on the understanding of karmic causes; {16.15}

source: མཆོག་དང་ཐ་མའི་སྤྱོད་པ་དང་། །དགེ་བའི་དོན་དང་ལྡན་པ་དང་། །ཟློས་པ་གྲུབ་པའི་མཚན་མ་དང་། །བསྒྲུབ་བྱ་སྒྲུབ་མིན་རྣམ་པར་བརྟགས། །
en: “ ‘Teach about the signs of the reciters’ accomplishments, Differentiated in terms of what should and should not be accomplished, [The signs] exhibited by those entered into and possessed [by spirits], And the reciters who pursue various virtuous goals; {16.16}

source: འབྱོར་པ་འདོད་དང་དེ་བཞིན་དུ། །འཇིག་རྟེན་དབང་ཕྱུག་ལོངས་སྤྱོད་འདོད། །
en: “ ‘Teach also, for the sake of those who desire, in this world, Riches, power, and enjoyments,

source: རྒྱལ་པོ་ཁྱད་པར་ཅན་འདོད་དང་། །རིག་པ་འཛིན་པ་གྲུབ་འདོད་དང་། །
en: For those who want to rise to prominence and obtain a kingdom, And for those who want to hold on to their success. {16.17}

source: ཐམས་ཅད་ཀུན་འགྲོའི་ཡེ་ཤེས་ཀྱིས། །མདོར་བསྡུས་ནས་ནི་བཤད་དུ་གསོལ། །
en: “ ‘In short, please teach The complete, all-pervading knowledge.’ ”

source: རྒྱལ་བའི་སྲས་ཀྱིས་གསོལ་བཏབ་ནས། །ཐུབ་པ་མཆོག་གིས་གསུངས་པ་ནི། །
en: So spoke the supreme sage, When requested by [Vajrapāṇi,] the son of the victorious ones. {16.18}

source: བློ་ལྡན་ཀ་ལ་པིང་ཀའི་སྐད། །ལྷ་ཡི་རྔ་སྒྲའི་སྐད་དང་ནི། །བརྩོན་འགྲུས་ཆེན་པོ་ཚངས་པའི་སྒྲ། །འབྲུག་སྒྲ་ཡི་ནི་སྒྲ་སྐད་ཀྱིས། །ཐུབ་པ་བདུན་པས་ཚིག་བཤད་ནས། །སངས་རྒྱས་གསུང་ནི་དག་པས་གསུངས། །
en: The seventh sage then spoke [the following] stanzas In the pure voice of the Buddha’s speech. The wise one had a voice like that of a cuckoo bird, Spreading like the sound of a celestial drum, As sweet as Brahmā’s, and resounding like A thunderous cloud of great might. {16.19}

source: གཞོན་ནུ་འདི་ནི་དངོས་དོན་ཁྱབ་རྒྱུར་ཅིང་། །མ་བྱུང་འཇིག་རྟེན་ཕན་པ་སྒྲུབ་བྱེད་ལ། །འགྲོ་བ་ཀུན་ལ་ཕན་པ་དགེ་ཕྱིར་སྟོན། །
en: “Those, O divine youth, who abide in the highest truth Gain accomplishments to benefit the world. They guide the world to every good fortune and benefit.

source: ཐར་པ་ཤེས་ཤིང་དག་པའི་གནས་སུ་འདུག །
en: May [the accomplishments] of these lords of liberation remain pure. {16.20}

source: བདེན་དང་བརྩེ་དང་བཟོད་པ་ཕན་སེམས་དང་། །གང་ཞིག་རྟག་ཏུ་བྱམས་དང་སྦྱིན་ལ་དགའ། །དེ་དག་རྟག་ཏུ་གྲུབ་པ་ཐོབ་པར་བྱེད། །
en: “Those who possess honesty, unwavering diligence, a sober mind, And loving kindness and who always delight in generosity Will always be successful;

source: ཀྱེ་མ་གཞན་ལའང་གྲུབ་པ་ཡོད་མ་ཡིན། །
en: Others will never succeed. {16.21}

source: རྟག་ཏུ་སྔགས་མཆོག་ལ་ནི་དགའ་དད་དམ། །བསྟན་དང་འཁོར་ལོ་འཛིན་དང་འཇམ་མཆོག་དང་། །དེ་ནི་བདུད་འདུལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར། །འཁོར་ལོ་འཛིན་པར་འདིར་ནི་རིགས་པ་ཡིན། །
en: “Those who always find joy and delight in the supreme mantra And in the instructions of the wheel holder or of Mañjuvara Will overpower Māra and turn the wheel, Just as befits a wheel holder in this world. {16.22}

source: གང་གི་གསུང་ནི་བཟང་པོ་ཡིད་འོང་ཞིང་། །རྟག་ཏུ་བྱིས་པའི་སྐྱེ་བོ་རྣམ་སྤངས་ཡིན། །
en: “There is a divine speech, pleasing to the mind, From which, however, fools are ever separated.

source: ཡིད་འོང་བཟང་པོ་རྣར་ནི་སྙན་པ་དང་། །དགའ་སྐྱེད་སྙན་པ་དང་ནི་རྗེས་སུ་མཐུན། །
en: This divine speech is pleasing to the ear, captivating, Lovely, sweet, and agreeable. {16.23}

source: སེམས་ནི་ཚིམ་བྱེད་བདེ་བ་རབ་ཏུ་སྦྱིན། །
en: “It refreshes the mind and bestows happiness.

source: འཇམ་ཞེས་བྱ་བར་སངས་རྒྱས་ཡང་དག་གསུང་། །
en: The buddhas call this speech Mañju.

source: དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཁྱད་པར་གྱིས། །གང་གིས་མཐུ་ནི་མཁྱེན་པར་མི་སྤྱོད་དེ། །
en: But even they, with their superior knowledge of a tathāgata, Are unable to understand his power. {16.24}

source: དེ་དག་གི་སྲས་དེ་བཞིན་སར་ཞུགས་པ། །འཇིག་རྟེན་འདས་པ་དེ་བཞིན་བཅུ་ཡི་གྲངས། །
en: “Their sons who are established on their respective levels And accordingly reckoned as falling into ten groups, perfect and divine,

source: ཁྱོད་ཀྱང་ལྷ་ཡི་དབང་ཕྱུག་འཇིག་རྟེན་ཁྱད་པར་གྱིས། །ཐུབ་བཟང་ཤེས་པར་ནུས་པ་མ་ཡིན་ནོ། །
en: Even they, O lord of gods, are unable To understand his divine power, which surpasses the ordinary. {16.25}

source: གཟུགས་དང་གཟུགས་མེད་དེ་བཞིན་ས་གནས་དང་། །འདོད་ལྡན་ལྷ་དང་མི་ནི་ཡིད་ལས་སྐྱེས། །རྣལ་འབྱོར་གྲུབ་པ་ཐོབ་དང་འཇིག་རྟེན་ན། །
en: “The same is true for the celestials of the form and formless realms, Gods of the desire realm, or human beings, Even if they have attained yogic accomplishments,

source: ཁྱད་པར་ཅན་ཀུན་དེ་བཞིན་མི་ཡི་གཙོ། །
en: Or for outstanding individuals who surpass everyone else in this world. {16.26}

source: དེ་ཡི་ཆེ་བ་གང་གིས་ཤེས་གྱུར་པ། །སེམས་ཅན་གང་དེ་ཡོད་པ་མ་ཡིན་ཏེ། །
en: “There is no being anywhere Who could fully understand his splendor.

source: ཁྱོད་ཀྱི་ཆེ་བ་འདི་ནི་ཡོངས་ཤེས་པ། །འཇམ་ཞེས་བྱ་བར་རབ་ཤེས་སངས་རྒྱས་ཡིན། །
en: The buddhas call him ‘Gentle Splendor,’ Knowing that splendor is merely a concept. {16.27}

source: འཇམ་དཔལ་ཞེས་བྱར་ཡོངས་སུ་བརྟགས་པ་ནི། །ཁྱོད་ཀྱི་མིང་ནི་སྔོན་གྱི་རྒྱལ་བས་མཛད། །
en: “ ‘Gentle Splendor’ is an imputation, A name given to you by the victors in the past.

source: ཁྱོད་ཀྱི་མིང་དུ་འདི་ལྟར་བརྟགས་བྱས་པ། །འདས་དང་མ་བྱོན་ད་ལྟར་སངས་རྒྱས་ཀྱི། །
en: It was imputed to you as your name By the past, present, and future buddhas. {16.28}

source: གཞན་དུ་མ་ཡེངས་རྩེ་གཅིག་ཡིད་དག་པས། །ཁྱོད་ཀྱི་མིང་ནི་འཁོར་གྱི་ནང་དུ་ཐོས། །
en: “One who hears your name in saṃsāra With a one-pointed mind that is neither distracted nor impure

source: དེས་ནི་འདི་ལ་ཤིས་དང་ཞི་བ་ཐོབ། །སྲིད་མཐར་བྱང་ཆུབ་མཆོག་ནི་ཁྱད་པར་ཐོབ། །
en: Will obtain the auspicious peace And awakening when still in saṃsāra. {16.29}

source: སྔགས་རྣམས་མ་ལུས་འགྲུབ་པར་འགྱུར་བ་དང་། །འགྲོ་བའི་སྐྱེ་གནས་མཆོག་ནི་རབ་ཐོབ་ཅིང་། །
en: “He will accomplish all the mantras And obtain the best possible rebirth and destiny.

source: རྟག་ཏུ་ཆོས་མཆོག་ལ་ནི་ཡང་དག་གནས། །བགེགས་རྣམས་རྣམ་པར་སྤང་ཤིང་གྲུབ་པ་ཐོབ། །
en: One who always relies on the supreme Dharma Will be free from obstacles and will attain accomplishment. {16.30}

source: འདོད་པའི་སྔགས་རྣམས་མ་ལུས་འགྲུབ་པར་བྱེད། །བྱང་ཆུབ་ཤིང་དབང་དྲུང་དུ་མྱུར་དུ་འགྲོ། །
en: “One will thus master all the desired mantras And swiftly attain the pleasant awakening in this world.

source: སོང་ནས་བྱང་ཆུབ་མཆོག་ནི་ཐོབ་པར་བྱེད། །སོང་ནས་སེམས་ཅན་ཕན་ཕྱིར་དེར་འདུག་སྟེ། །
en: The chief among sages arrives at the Bodhi tree And sits there for the benefit of beings. {16.31}

source: སངས་རྒྱས་བྱང་ཆུབ་འཁོར་ལོ་རབ་ཏུ་སྐོར། །དེ་ལྟར་རྒྱལ་བའི་གཙོ་བོས་ཡོན་ཏན་གསུངས། །
en: “He awakens to realization and turns the wheel [of Dharma], The quality of which has been described by the chief victors.

source: འཇམ་དཔལ་ཞེས་ནི་ཁྱོད་ཀྱི་མིང་དྲན་པ། །ཡོན་ཏན་བསམ་མི་ཁྱབ་ཅེས་རྒྱལ་བས་གསུངས། །
en: [The same] chief victors [also] described your name, remembered as ‘Glory’ ( Śrī ) that is called ‘Gentle’ ( Mañju ), as having inconceivable qualities. {16.32}

source: རྒྱལ་བའི་གཙོ་བོ་སྔར་གཤེགས་ཐམས་ཅད་ཀྱིས། །རྟག་ཏུ་ཁྱོད་ཀྱི་མཐུ་ནི་བསྟན་པ་ཡིན། །གཞོན་ནུ་དག་པ་ཁྱོད་ཀྱི་སྔགས་རྟོགས་པ། །བསྐལ་པ་གྲངས་མེད་རྟག་ཏུའང་སྟོན་མི་ནུས། །
en: “The chief victors of the past, however many there have been, Even if they were to explain your power continually Over innumerable eons, would not be able to describe it Nor [the power of] the hundreds of mantras, O pure divine youth! {16.33}

source: འཇམ་དཔལ་ཁྱོད་ཀྱི་སྔགས་ཀྱི་སྤྱོད་པ་ནི། །སངས་རྒྱས་མ་ལུས་དག་གིས་རབ་ཏུ་བཤད། །
en: “All the buddhas, without exception, have taught The complete mantra system of Mañjuśrī.

source: གཞོན་ནུ་འདི་ནི་ཐམས་ཅད་ཀུན་ཏུ་འགྲོ། །ང་ཡི་བསྟན་ལ་ཁྱོད་ནི་མི་མཆོག་བསྟན། །
en: These instructions of yours, O divine youth, cover everything, And the diligent ones derive the highest pleasure from them. {16.34}

source: དག་པའི་གནས་ལ་གནས་པའི་སྐྱེ་བོ་རྣམས། །འདིར་ནི་མ་ལུས་མཐའ་དག་ཞི་བར་འགྱུར། །ཁྱོད་ཀྱི་སྔགས་ནི་ནམ་ཡང་འདའ་མ་གྱུར། །ཁྱོད་ཀྱི་སྔགས་ནི་ནམ་ཡང་ཉམས་མ་གྱུར། །
en: “Beings who dwell in the Pure Abode, And all beings without exception, will attain peace If they never violate your mantra In any way whatsoever.” {16.35}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག །བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། །ཚིགས་སུ་བཅད་པའི་ལེའུ་རབ་འབྱམ་བཅུ་དྲུག་པ་རྫོགས་སོ།། །།
en: This concludes the detailed sixteenth chapter with versified instructions in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Now Lord Śākyamuni entered the samādhi called the magical display of all the tathāgatas .

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ། སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་འོད་ཟེར་སྔོན་པོ་དང་སེར་པོ་དང་དཀར་པོ་དང་ལེ་བརྒན་དང་ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་སྟེ།
en: As soon as he entered this samādhi, rays of blue, yellow, dazzling white, red, and crystal-colored light issued from the tuft of hair between his eyebrows.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ཀྱང་སྣང་བར་བྱས་ཤིང་། འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཀྱང་སྣང་བར་མཛད་ནས།
en: They brightened the entire buddhafield and illuminated the interior of every realm of the universe,

source: གཟའ་དང་རྒྱུ་སྐར་ཐམས་ཅད་ཀྱང་ཡུད་ཙམ་གྱིས་ཟིལ་གྱིས་མནན་ཏེ་བཀུག་པར་གྱུར་ཏོ། །
en: while darkening all the planets and constellations and summoning them in an instant.

source: བཀུག་ནས་ཀྱང་རང་རང་གི་གནས་ལ་ཡང་དག་པར་སྦྱར་ནས། འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་བཀུག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་མཛོད་སྤུ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: After summoning them, the light assigned them to their respective places and drew them, by the power of the Buddha’s blessing, into the circle of the assembly. It then disappeared into the same tuft of hair between Lord Śākyamuni’s eyebrows.

source: གཟའ་དང་རྒྱུ་སྐར་དང་སྐར་མ་ཐམས་ཅད་ཀྱི་འོད་མེད་པར་བྱས་ནས་ཉམ་ཐག་པ་དང་འཇིགས་པས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་སྐྱབས་སུ་འགྲོ་ཞིང་ཐལ་མོ་སྦྱར་ནས་འདུག་པར་གྱུར་ཏེ། དེ་ལྟར་རབ་ཏུ་འདར་ཞིང་ཡང་དང་ཡང་སའི་སྟེང་དུ་འགྱེལ་བར་གྱུར་ཏོ། །
en: All the planets, constellations, and stars, their light blocked, approached Lord Śākyamuni, pained and frightened. They stood with folded hands, trembling and prostrating themselves on the ground again and again. {17.1}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་གཟའ་དང་རྒྱུ་སྐར་དང་སྐར་མ་ཐམས་ཅད་ལ་མཁས་པ་རྣམས་དང་།
en: Lord Śākyamuni then gave the following talk For all the celestial bodies such as planets, constellations, and stars.

source: བྱིས་པའི་སྐྱེ་བོའི་བློ་དང་ལྡན་པའི་སེམས་ཅན་རྗེས་སུ་གཟུང་བའི་ཕྱིར་བཀའ་སྩལ་པ་ནི།
en: He gave it as an act of kindness for all the beings Born with the intelligence of a child. {17.2}

source: ལྷའི་ཚོགས་མི་དང་བཅས་པའི་གྲོགས་པོ་དག་ཁྱེད་ཅག་ཉོན་ཅིག །
en: “Listen, esteemed friends, hosts of gods along with men.

source: འཇིག་རྟེན་སྣ་ཚོགས་ནི་ལས་ཉིད་ལ་སེམས་ཅན་རྣམས་རྣམ་པར་རྟེན་པར་བྱེད་དེ།
en: The karma of individual beings causes them to experience the world differently.

source: གང་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་རྡོ་རྗེའི་སྐུ་ཡང་མངོན་པར་གྲུབ་ལ། གང་ཡང་ལྷ་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཡང་འཁོར་ཞིང་། འཁོར་བའི་འབྲོག་དགོན་པ་ཆེན་པོར་རབ་ཏུ་ཞུགས་ལ། འཇིག་རྟེན་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ལུས་མངོན་པར་གྲུབ་སྟེ
en: The way the bodies of beings manifest, whether the vajra bodies of the blessed buddhas or the various bodies of gods, asuras, and humans circling in saṃsāra, lost in its wilderness—all of this is a product of karma.

source: ཐམས་ཅད་ཀྱང་ལས་དགེ་བ་དང་མི་དགེ་བ་དང་འབྲེལ་བ་ལས་སྐྱེས་ལ།
en: This karma, whether it is good or bad, still constitutes fetters.

source: དེ་ལ་བྱེད་པའི་བྱེད་པ་པོའམ་དབང་ཕྱུག་གམ་གཙོ་བོའམ་སྐྱེས་བུའམ་གྲངས་ཅན་གྱིས་རབ་ཏུ་འབྱིན་པར་བྱེད་པ་ནི་གང་ཡང་མེད་དོ། །
en: There is no creator here who creates, nor godhead, nor the puruṣa and prakṛti as espoused in the Sāṃkhya system.

source: ལས་ལས་སྐྱེས་པ་ནི་མ་གཏོགས་ཏེ།
en: Nothing of this kind exists, except for that which is produced by karma.

source: དེ་ཡང་ལས་ཀྱི་རྐྱེན་གྱིས་སྐྱེད་པ་རྒྱུ་ལ་ལྟོས་པ་ཡིན་ཏེ།
en: Everything that is generated in dependence upon karma thus has a cause.

source: དེ་ཡང་རྒྱུ་དང་རྐྱེན་ལ་ལྟོས་པའོ། །
en: This cause, in turn, depends on its own causes and conditions.

source: དེ་བཞིན་དུ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རྐྱེན་ཕན་ཚུན་དུ་འབྱུང་བ་ཉེ་བར་འབྲེལ་བ་ཡིན་ཏེ།
en: In this way, everything is mutually interconnected, being generated through dependent origination.

source: ལྷག་མ་འབྱུང་པོ་རྣམས་མངོན་པར་འགྲུབ་པ་ནི་འབྱུང་བ་ཆེན་པོ་ལས་སྐྱེས་པ་ཡིན་ཏེ།
en: Living beings are generated from the [five] great elements that coalesce together. {17.3}

source: འབྱུང་བ་ཆེན་པོ་དེ་ཡང་མ་འོངས་པའི་ཕུང་པོ་གཞན་དག་ཏུ་འགྲོ་བར་སྐྱེ་བར་འགྱུར་ཞིང་།
en: “These great elements exist within the five aggregates throughout the beginningless transmigrations.

source: སྐྱེས་ནས་ཀྱང་འགྲོ་བ་དང་། ཡུལ་གཞན་རྒྱ་ཆེ་བའི་རྣམ་པར་དབྱེ་བ་དག་ཏུ་སྐྱེ་བར་འགྱུར་ཏེ
en: They manifest in the place of another birth, developing into an elaborate [whole] with all the [constituent] parts.

source: དུས་གཞན་ན་ལུགས་ལས་བཟློག་སྟེ་འགག་པ་ན་ཡེ་ཤེས་ཀྱི་མེས་བསྐུལ་ཏེ། ལས་ཀྱིས་བསགས་པའི་བག་ཆགས་མཐའ་དག་མངོན་པར་བསྲེགས་ནས།
en: The habitual tendencies generated by karmic actions can, however, be completely burnt by the fire of gnosis that blocks and prevents [the arising of elements ] at another time.

source: ཐེག་པ་རྣམ་པ་གསུམ་མཉམ་ཞིང་སྤྲོས་པ་མེད་པར་ཡང་དག་པར་བསྒྲུབ་པར་འགྱུར་རོ། །
en: One can effectively accomplish the equality of the three vehicles and the state without conceptual elaboration.

source: ཐེག་པ་ཆེན་པོ་ནི་དུས་རིང་པོར་ཉེ་བར་ཆགས་པའི་ལས་བདག་གིར་བྱེད་པ་དང་།
en: This will happen as the result of the karma produced by following the Mahāyāna for a long time.

source: དུས་བར་མ་ནི་རང་རྒྱལ་བ་བསེ་རུ་ལྟ་བུ་རང་བྱུང་གི་ཤེས་རབ་རབ་ཏུ་འབྱུང་བ་དང་།
en: Following [the Mahāyāna] for a medium length of time will bring about the self-arising gnosis of a rhinoceros-like pratyeka­buddha.

source: གཞན་གྱི་སྒྲའི་རྗེས་སུ་འཇུག་པ་ཉན་ཐོས་ནི་དུས་ཐུང་ངུས་མངོན་པར་འཚང་རྒྱ་བའོ། །
en: Within a short time, one can attain the regal state of a śrāvaka who listens to the teachings of others.

source: ཆོས་གཞན་ལ་བློ་ཉིད་འཇུག་པར་འགྱུར་བ་ནི་མ་ཡིན་ཏེ། བྱིས་པ་རྣམས་ཀྱི་རྣམ་པར་རྨོངས་པ་ཉིད་དང་ཇི་སྟེ་ཡང་འཇིག་རྟེན་སྣ་ཚོགས་གནས་པ་འདི་ནི་ལས་ལས་སྐྱེས་པ་ཡིན་ཏེ།
en: If naive and confused people do not turn to non-Buddhist doctrines, their intelligence will grow. {17.4} “This world, with its different places and situations, is produced by different types of karma.

source: ཕྱོགས་དང་ཆ་བྱད་ཞིག་ན་ནད་མེད་པའི་གོ་འཕང་མྱ་ངན་མེད་པ། རྡུལ་མེད་པ་ལས་ཀྱིས་འཇིག་རྟེན་གྲུབ་པ་ལ་ལྟོས་པ་ཡིན་ཏེ། དྲི་མ་མེད་པའི་ལམ་རྣམ་པར་གྲོལ་བ། ཡན་ལག་བརྒྱད་དང་ལྡན་པ། ཤིན་ཏུ་བསིལ་བའི་ལས་ཉིད་ཀྱིས་བྱེད་དེ།
en: Its cessation—the auspicious state without old age, sorrowless and pure—[is produced by] karma based on worldly accomplishments that are pure, [namely] the detached eightfold karma that arises out of the [eightfold] path.

source: ལས་གཞན་ལ་ལྟོས་པ་མ་ཡིན་ཞིང་ལས་དང་ལས་མ་ཡིན་པ་ལས་རྣམ་པར་གྲོལ་ཏེ། སྤྲོས་པ་མེད་པ་ལ་ཉེ་བར་གནས་པ་ཡིན་ནོ། །
en: Karma is produced by karma and has no other basis but itself. {17.5} “One who is free from dualistic thinking Will remain free from both action and inaction.

source: ཐེག་པ་རྣམ་གསུམ་རབ་འཇུག་ལས། །ཞི་བ་གཞན་ཡང་ཡོད་མིན་ཏེ། །
en: Following the threefold path, one will obtain No other tranquility [but that of the path]. {17.6}

source: སྔགས་ཀྱང་རྣམ་པ་གསུམ་དུ་འགྱུར། །
en: “The mantras thus fall into three groups,

source: རྣམ་གསུམ་ལས་སུ་ཡང་དག་བསྒྲགས། །
en: And the [resulting] activity is of three kinds.

source: དེ་ལས་རྣམ་ཟློས་རྣམ་གསུམ་ལས། །རྣམ་པ་གསུམ་དུ་རབ་ཏུ་སྣང་། །
en: The fruit [thereof] is threefold And the reflection [thereupon] is threefold too. {17.7}

source: རིགས་ཀྱང་རྣམ་གསུམ་གསུངས་པ་ནི། །སྔགས་རྣམས་ཀུན་གྱི་གཞི་ཡང་ཡིན། །
en: “Inverted activity is threefold And is regarded as such.

source: རིགས་གསུམ་རྣམ་པ་བརྒྱད་དུ་ཡང་། །རྒྱུད་དག་ལ་ནི་རབ་ཏུ་སྣང་། །
en: Virtue is regarded as threefold, As can be gleaned from the tantras. {17.8}

source: རྣམ་པ་གཅིག་ཏུ་འང་རིགས་སྣང་སྟེ། །སྔགས་རྣམས་ཀུན་གྱི་གནས་ཀྱང་ཡིན། །
en: “The religious community is also such, And so is the entire seat of the mantras.

source: སངས་རྒྱས་རྣམས་ཀྱི་དག་པའི་ཐུགས། །རིགས་ནི་ཞི་བ་མྱ་ངན་འདས། །
en: The community of buddhas with pure minds Abides in the peace of nirvāṇa. {17.9}

source: ཡན་ལག་སོ་སོ་དེ་ཉིད་ལས། །སྔགས་རྣམས་ཀུན་ཏུ་རབ་ཏུ་བསྟན། །
en: “This karma is here taught, section by section, As part of the science of mantras.

source: འཇིག་རྟེན་སྐར་མཁན་ཡན་ལག་ནི། །གྲུབ་པའི་རྒྱུར་ནི་རབ་ཏུ་བརྟག །
en: For the sake of success in the world, The discipline of astrology has also been taught.
